app/Models/Categoria.php

    public function getCategorias() {
        $query = $this->db->table('fastquizdatabase_categoria')
                            ->select('*')
                            ->orderby('desc_categoria', 'ASC')
                            ->get();
---
SELECT *
FROM "fastquizdatabase_categoria"
ORDER BY "desc_categoria" ASC